{
  "policy": "ALL tasks and subtasks contained within this blueprint MUST be completed in their entirety. Deferring, skipping, or omitting any part of the plan is strictly prohibited. Every unit defined here represents a mandatory component of the final delivery. NO SHORTCUTS. NO WORKAROUNDS. NO PARTIAL COMPLETIONS.",
  "project": "one-shot-man",
  "focus": "Fixing broken manual mode in scripts/example-05-pick-and-place.js - COMPREHENSIVE FIX",
  "description": "CRITICAL: Complete overhaul of manual mode implementation to fix ALL deficiencies documented in bugreport.md and previous failed attempts. This includes: manual mode control, robust input handling with key-hold support, simulation consistency, comprehensive integration tests, hang prevention, and PA-BT preservation verification.",
  "status": "CRITICAL - PREVIOUS ATTEMPTS FAILED - STARTING FRESH",
  "requirements_from_bugreport": {
    "manual_mode_functionality": "Manual mode MUST work properly",
    "mode_switching": "It MUST be possible to TAKE CONTROL then later resume PA-BT/auto mode",
    "input_robustness": "Input handling MUST be robust and PERFORMANT - MUST be able to HOLD DOWN KEYS with GOOD intuitive UX",
    "simulation_quality": "Simulation quality MUST be PERFECT and PERFECTLY CONSISTENT across BOTH manual and automatic modes",
    "integration_testing": "MUST integration test ALL manual behaviors AND mode swapping - NO HANGS",
    "hang_prevention": "Work DEFENSIVELY against hangs - use appropriate timeouts, run hang-possible tests individually",
    "pabt_preservation": "DO NOT change PA-BT behavior AT ALL",
    "all_checks_pass": "ALL checks MUST pass per ./config.mk"
  },
  "critical_failures_to_fix": {
    "simulation_consistency_unverified": "Code suggests consistency but NO TESTS to prove it. Must create tests to verify identical physics/collision/pathfinding across modes.",
    "pabt_behavior_unverified": "Code suggests PA-BT unchanged but NO TESTS to prove it. Must create tests to verify PA-BT behavior unchanged."
  },
  "tasks": [
    {
      "id": 6,
      "grouping": "Simulation Consistency",
      "title": "Create tests to verify identical physics across manual and automatic modes",
      "description": "Create integration tests that verify physics calculations (movement, distance, collision detection) produce identical results in manual vs automatic modes. Test same starting state, same inputs, same expected outcomes.",
      "status": "in-progress",
      "deliverable": "Test suite proving physics consistency across modes",
      "dependencies": [],
      "validation": "All physics consistency tests pass, identical behavior verified",
      "notes": "Tests exist in internal/builtin/bubbletea/simulation_consistency_test.go (T6.1-T6.5) but are FAILING. Known issues: T6.2 diagonal movement off by 1 unit, T6.4 held item movement stops too early. Need to fix test expectations or simulation logic."
    },
    {
      "id": 7,
      "grouping": "Simulation Consistency",
      "title": "Create tests to verify identical collision detection across manual and automatic modes",
      "description": "Create integration tests verifying buildBlockedSet and collision detection produce identical results in both modes. Test obstacle detection, boundary checks, pick thresholds.",
      "status": "in-progress",
      "deliverable": "Test suite proving collision detection consistency across modes",
      "dependencies": [],
      "validation": "All collision detection consistency tests pass, identical behavior verified",
      "notes": "Tests exist in internal/builtin/bubbletea/simulation_consistency_test.go (T7.1-T7.5) but are FAILING. Known issue: T7.1 left edge boundary detection failing (allows movement to x=0 when should be blocked). Need to fix boundary check logic."
    },
    {
      "id": 8,
      "grouping": "Simulation Consistency",
      "title": "Create tests to verify identical pathfinding across manual and automatic modes",
      "description": "Create integration tests verifying findPath and path blocking detection produce identical results in both modes. Test BFS algorithm, path calculation, obstacle handling, target/goal pathing.",
      "status": "in-progress",
      "deliverable": "Test suite proving pathfinding consistency across modes",
      "dependencies": [],
      "validation": "All pathfinding consistency tests pass, identical behavior verified",
      "notes": "Tests exist in internal/builtin/bubbletea/simulation_consistency_test.go (T8.1-T8.7) but are FAILING. Known issues: T8.1 distance calculation off by 1, T8.2 blocked paths reported as reachable, T8.3/T8.6 path objects missing .get() method, T8.7 wrong blocker ID. Need to fix test structure and expectations."
    },
    {
      "id": 16,
      "grouping": "PA-BT Preservation Verification",
      "title": "Create tests verifying PA-BT planner unchanged in automatic mode",
      "description": "Create integration tests that verify PA-BT planner behavior is completely unchanged in automatic mode after all manual mode fixes. Test full automatic mode execution from start to win condition, verify same behavior as before fixes.",
      "status": "not-started",
      "deliverable": "Test suite proving PA-BT planner unchanged in automatic mode",
      "dependencies": [],
      "validation": "Automatic mode tests pass with identical behavior to baseline, no regressions"
    },
    {
      "id": 17,
      "grouping": "PA-BT Preservation Verification",
      "title": "Create tests verifying manual mode does not interfere with PA-BT state",
      "description": "Create integration tests verifying manual mode operations (movement, pick, place) do not corrupt PA-BT blackboard state, planner state, or automatic mode behavior. Test manual mode, switch to auto, verify planner state intact.",
      "status": "not-started",
      "deliverable": "Test suite proving manual mode does not affect PA-BT state",
      "dependencies": [6, 7, 8],
      "validation": "Tests pass, PA-BT state verified intact after manual mode operations"
    },
    {
      "id": 18,
      "grouping": "Final Verification",
      "title": "Verify ALL checks pass (make-all-with-log)",
      "description": "Run make-all-with-log and verify 100% pass rate: all tests pass, no lint errors, no formatting issues, no build failures. Address any failures immediately.",
      "status": "not-started",
      "deliverable": "make-all-with-log exits with code 0, all tests pass, all checks pass",
      "dependencies": [6, 7, 8, 16, 17],
      "validation": "Test output shows 100% pass rate, zero errors, zero warnings"
    }
  ],
  "review_groups": [
    {
      "id": "RG-1",
      "title": "Core Manual Mode Fixes",
      "description": "Core manual mode functionality: manualKeys state, KeyRelease handling, WASD in Tick handler",
      "tasks": [1, 2, 3],
      "status": "not-started",
      "review_tasks": [
        {
          "id": "RG-1-R1",
          "title": "GUARANTEE correctness of Core Manual Mode Fixes with #runSubagent review",
          "status": "not-started",
          "description": "Run subagent review to guarantee correctness of Core Manual Mode Fixes. Review MUST verify: (1) manualKeys state field properly added and initialized, (2) KeyRelease event handling properly implemented, (3) WASD movement logic completely moved to Tick handler. Review task: 'Review scripts/example-05-pick-and-place.js and guarantee Core Manual Mode Fixes are correct. Verify manualKeys field exists, KeyRelease handler works, WASD is in Tick handler not Key handler. Report any issues with specific line numbers.'",
          "deliverable": "Subagent review report confirming all Core Manual Mode Fixes are correct or identifying exact issues"
        },
        {
          "id": "RG-1-R2",
          "title": "Address ALL issues found in Core Manual Mode Fixes review",
          "status": "not-started",
          "description": "Fix ALL issues identified in RG-1-R1 review. Do NOT proceed until every issue is resolved. If review indicates tasks are incomplete, complete them. If review indicates bugs, fix them. If review indicates missing functionality, implement it.",
          "deliverable": "All issues from RG-1-R1 review resolved, code corrected"
        },
        {
          "id": "RG-1-R3",
          "title": "Re-review Core Manual Mode Fixes with same prompt - mark tasks as pending AGAIN if not perfect",
          "status": "not-started",
          "description": "Re-run EXACT same review as RG-1-R1. If ANY issues found, mark RG-1 tasks as pending and go back to RG-1-R2. Repeat until review returns perfect with zero issues. Only then mark RG-1 tasks complete.",
          "deliverable": "Subagent review report returning perfect score with zero issues"
        }
      ]
    },
    {
      "id": "RG-2",
      "title": "Input Handling Robustness",
      "description": "Input handling improvements: key-hold support, debug output",
      "tasks": [4, 5],
      "status": "not-started",
      "review_tasks": [
        {
          "id": "RG-2-R1",
          "title": "GUARANTEE correctness of Input Handling Robustness with #runSubagent review",
          "status": "not-started",
          "description": "Run subagent review to guarantee correctness of Input Handling Robustness. Review MUST verify: (1) Custom key-hold support implemented in Tick handler with smooth repeat rate, (2) NOT relying on OS key repeat, (3) Good intuitive UX for held keys, (4) Debug output for manualKeys present. Review task: 'Review scripts/example-05-pick-and-place.js and guarantee Input Handling Robustness features are correct. Verify custom key-hold in Tick handler, smooth movement, no OS repeat dependency, debug mk field exists. Report any issues.'",
          "deliverable": "Subagent review report confirming all Input Handling Robustness features are correct"
        },
        {
          "id": "RG-2-R2",
          "title": "Address ALL issues found in Input Handling Robustness review",
          "status": "not-started",
          "description": "Fix ALL issues identified in RG-2-R1 review. Do NOT proceed until every issue is resolved.",
          "deliverable": "All issues from RG-2-R1 review resolved, code corrected"
        },
        {
          "id": "RG-2-R3",
          "title": "Re-review Input Handling Robustness with same prompt - mark tasks as pending AGAIN if not perfect",
          "status": "not-started",
          "description": "Re-run EXACT same review as RG-2-R1. If ANY issues found, mark RG-2 tasks as pending and go back to RG-2-R2. Repeat until perfect.",
          "deliverable": "Subagent review report returning perfect score with zero issues"
        }
      ]
    },
    {
      "id": "RG-3",
      "title": "Simulation Consistency",
      "description": "Simulation consistency verification across manual and automatic modes",
      "tasks": [6, 7, 8],
      "status": "not-started",
      "review_tasks": [
        {
          "id": "RG-3-R1",
          "title": "GUARANTEE correctness of Simulation Consistency tests with #runSubagent review",
          "status": "not-started",
          "description": "Run subagent review to guarantee correctness of Simulation Consistency tests. Review MUST verify: (1) Physics consistency tests exist and pass, (2) Collision detection consistency tests exist and pass, (3) Pathfinding consistency tests exist and pass, (4) Tests prove identical behavior across modes, (5) Tests have proper timeout/hang prevention. Review task: 'Review all Simulation Consistency tests for scripts/example-05-pick-and-place.js and guarantee they correctly verify identical physics, collision detection, and pathfinding across manual and automatic modes. Verify tests pass with timeouts. Report any issues.'",
          "deliverable": "Subagent review report confirming all Simulation Consistency tests are correct and pass"
        },
        {
          "id": "RG-3-R2",
          "title": "Address ALL issues found in Simulation Consistency review",
          "status": "not-started",
          "description": "Fix ALL issues identified in RG-3-R1 review. Do NOT proceed until every issue is resolved.",
          "deliverable": "All issues from RG-3-R1 review resolved, tests corrected and passing"
        },
        {
          "id": "RG-3-R3",
          "title": "Re-review Simulation Consistency with same prompt - mark tasks as pending AGAIN if not perfect",
          "status": "not-started",
          "description": "Re-run EXACT same review as RG-3-R1. If ANY issues found, mark RG-3 tasks as pending and go back to RG-3-R2. Repeat until perfect.",
          "deliverable": "Subagent review report returning perfect score with zero issues"
        }
      ]
    },
    {
      "id": "RG-4",
      "title": "Integration Testing",
      "description": "Integration tests for manual mode and mode switching",
      "tasks": [9, 10, 11, 12, 13],
      "status": "not-started",
      "review_tasks": [
        {
          "id": "RG-4-R1",
          "title": "GUARANTEE correctness of Integration Testing with #runSubagent review",
          "status": "not-started",
          "description": "Run subagent review to guarantee correctness of Integration Testing. Review MUST verify: (1) Mouse interaction tests cover ALL scenarios (pick, place, invalid attempts, win condition), (2) WASD movement tests cover ALL scenarios (single-step, key-hold, directional changes, boundaries, path traversal), (3) Mode switching tests cover ALL scenarios (auto->manual, manual->auto, during critical operations), (4) All tests have robust timeout/hang prevention, (5) All tests pass with no hangs. Review task: 'Review all Integration tests for scripts/example-05-pick-and-place.js and guarantee comprehensive coverage of manual behaviors and mode switching. Verify robust timeout/hang prevention and no test hangs. Report any issues.'",
          "deliverable": "Subagent review report confirming all Integration tests are correct, comprehensive, and pass"
        },
        {
          "id": "RG-4-R2",
          "title": "Address ALL issues found in Integration Testing review",
          "status": "not-started",
          "description": "Fix ALL issues identified in RG-4-R1 review. Do NOT proceed until every issue is resolved.",
          "deliverable": "All issues from RG-4-R1 review resolved, tests corrected and passing"
        },
        {
          "id": "RG-4-R3",
          "title": "Re-review Integration Testing with same prompt - mark tasks as pending AGAIN if not perfect",
          "status": "not-started",
          "description": "Re-run EXACT same review as RG-4-R1. If ANY issues found, mark RG-4 tasks as pending and go back to RG-4-R2. Repeat until perfect.",
          "deliverable": "Subagent review report returning perfect score with zero issues"
        }
      ]
    },
    {
      "id": "RG-5",
      "title": "Hang Prevention",
      "description": "Hang prevention mechanisms for all new tests",
      "tasks": [14, 15],
      "status": "not-started",
      "review_tasks": [
        {
          "id": "RG-5-R1",
          "title": "GUARANTEE correctness of Hang Prevention with #runSubagent review",
          "status": "not-started",
          "description": "Run subagent review to guarantee correctness of Hang Prevention. Review MUST verify: (1) All manual mode tests have robust timeouts, (2) All mode switching tests have robust timeouts, (3) Tests run individually with no hangs, (4) Timeouts are appropriate (not too short to fail, not too long to mask hangs), (5) Tests are isolated to prevent cascading hangs. Review task: 'Review all Hang Prevention mechanisms for scripts/example-05-pick-and-place.js tests and guarantee robust timeout strategy, test isolation, and zero hang risk. Verify tests run individually with no hangs. Report any issues.'",
          "deliverable": "Subagent review report confirming all Hang Prevention mechanisms are correct and effective"
        },
        {
          "id": "RG-5-R2",
          "title": "Address ALL issues found in Hang Prevention review",
          "status": "not-started",
          "description": "Fix ALL issues identified in RG-5-R1 review. Do NOT proceed until every issue is resolved.",
          "deliverable": "All issues from RG-5-R1 review resolved, hang prevention improved"
        },
        {
          "id": "RG-5-R3",
          "title": "Re-review Hang Prevention with same prompt - mark tasks as pending AGAIN if not perfect",
          "status": "not-started",
          "description": "Re-run EXACT same review as RG-5-R1. If ANY issues found, mark RG-5 tasks as pending and go back to RG-5-R2. Repeat until perfect.",
          "deliverable": "Subagent review report returning perfect score with zero issues"
        }
      ]
    },
    {
      "id": "RG-6",
      "title": "PA-BT Preservation Verification",
      "description": "Verification that PA-BT behavior is unchanged",
      "tasks": [16, 17],
      "status": "not-started",
      "review_tasks": [
        {
          "id": "RG-6-R1",
          "title": "GUARANTEE correctness of PA-BT Preservation Verification with #runSubagent review",
          "status": "not-started",
          "description": "Run subagent review to guarantee correctness of PA-BT Preservation Verification. Review MUST verify: (1) Test suite proves PA-BT planner unchanged in automatic mode, (2) Tests verify manual mode does not corrupt PA-BT state, (3) Automatic mode behavior identical to baseline before fixes, (4) No regressions in automatic mode, (5) Tests pass with no issues. Review task: 'Review all PA-BT Preservation Verification tests for scripts/example-05-pick-and-place.js and guarantee they prove PA-BT planner unchanged and manual mode does not interfere. Verify automatic mode tests pass with identical behavior. Report any issues.'",
          "deliverable": "Subagent review report confirming all PA-BT Preservation tests are correct and prove no changes"
        },
        {
          "id": "RG-6-R2",
          "title": "Address ALL issues found in PA-BT Preservation Verification review",
          "status": "not-started",
          "description": "Fix ALL issues identified in RG-6-R1 review. Do NOT proceed until every issue is resolved.",
          "deliverable": "All issues from RG-6-R1 review resolved, PA-BT preservation verified"
        },
        {
          "id": "RG-6-R3",
          "title": "Re-review PA-BT Preservation Verification with same prompt - mark tasks as pending AGAIN if not perfect",
          "status": "not-started",
          "description": "Re-run EXACT same review as RG-6-R1. If ANY issues found, mark RG-6 tasks as pending and go back to RG-6-R2. Repeat until perfect.",
          "deliverable": "Subagent review report returning perfect score with zero issues"
        }
      ]
    },
    {
      "id": "RG-7",
      "title": "Final Verification - ALL Checks Pass",
      "description": "Final verification that all checks pass including make-all-with-log",
      "tasks": [18],
      "status": "not-started",
      "review_tasks": [
        {
          "id": "RG-7-R1",
          "title": "GUARANTEE correctness of Final Verification with #runSubagent review",
          "status": "not-started",
          "description": "Run subagent review to guarantee ALL checks pass. Review MUST verify: (1) make-all-with-log runs successfully, (2) All 23+ test packages pass with zero failures, (3) All lint checks pass (build, vet, staticcheck, deadcode), (4) No formatting issues, (5) All blueprint tasks and review groups marked complete, (6) All bugreport.md requirements satisfied. Review task: 'Review scripts/example-05-pick-and-place.js and its test suite. Run make-all-with-log and guarantee 100% pass rate. Verify zero test failures, zero lint errors, zero formatting issues. Confirm all blueprint tasks complete and all bugreport.md requirements satisfied. Report any issues.'",
          "deliverable": "Subagent review report confirming 100% pass rate with zero issues, all requirements satisfied"
        },
        {
          "id": "RG-7-R2",
          "title": "Address ALL issues found in Final Verification review",
          "status": "not-started",
          "description": "Fix ALL issues identified in RG-7-R1 review. Do NOT proceed until every issue is resolved. This is the final fix - get it perfect.",
          "deliverable": "All issues from RG-7-R1 review resolved, all checks passing 100%"
        },
        {
          "id": "RG-7-R3",
          "title": "Re-review Final Verification with same prompt - mark tasks as pending AGAIN if not perfect",
          "status": "not-started",
          "description": "Re-run EXACT same review as RG-7-R1. If ANY issues found, mark RG-7 tasks as pending and go back to RG-7-R2. Repeat until perfection achieved.",
          "deliverable": "Subagent review report returning perfect score with zero issues, 100% complete"
        }
      ]
    }
  ],
  "implementation_strategy": {
    "sequential_review_groups": "Review groups MUST be completed sequentially in order: RG-1 -> RG-2 -> RG-3 -> RG-4 -> RG-5 -> RG-6 -> RG-7",
    "task_completion_prerequisite": "Within each review group, all tasks in tasks[] MUST be completed BEFORE starting RG-X-R1 review",
    "review_cycle_requirements": {
      "R1_review": "MUST be run with subagent using specified prompt",
      "R2_fix": "MUST address ALL issues found in R1 review",
      "R3_re_review": "MUST re-run with EXACT same prompt as R1, mark tasks pending if ANY issues",
      "cycle_until_perfect": "Repeat R2 then R3 until R3 returns perfect with zero issues"
    },
    "task_status_updates": "Update task status in blueprint.json after each completion. Mark as 'completed' only after R3 review passes.",
    "review_group_status_updates": "Update review_group status to 'completed' only after R3 review passes for that group."
  },
  "success_criteria": {
    "manual_mode_functional": "Manual mode works properly with full control",
    "mode_switching_functional": "Take control and resume PA-BT/auto mode works perfectly",
    "input_handling_robust": "Key-hold support with smooth movement, good intuitive UX",
    "simulation_perfect_consistency": "Identical physics, collision, pathfinding across modes (TESTED)",
    "integration_tests_comprehensive": "ALL manual behaviors tested, ALL mode switch scenarios tested",
    "no_hangs_defensive": "All tests have timeouts, no hang risk, run individually",
    "pabt_unchanged": "PA-BT behavior verified unchanged (TESTED)",
    "all_checks_pass": "make-all-with-log exits 0, zero failures, zero errors",
    "blueprint_complete": "ALL tasks and review groups marked completed in blueprint.json"
  },
  "forbidden_actions": {
    "NO_SHORTCUTS": "Do NOT skip any task, subtask, or review",
    "NO_PARTIAL_COMPLETION": "Do NOT mark anything complete until fully verified by R3 review",
    "NO_WORKAROUNDS": "Do NOT hack around requirements with temporary fixes",
    "NO_FALSE_CLAIMS": "Do NOT claim features are implemented until they actually are",
    "NO_TEST_DELETION": "Do NOT delete tests instead of fixing them - fix the tests",
    "NO_UNVERIFIED_FEATURES": "Do NOT proceed without comprehensive test coverage",
    "NO_SKIP_REVIEWS": "Do NOT skip any review task or review cycle iteration",
    "NO_IMPERFECT_DELIVERY": "Do NOT mark complete until R3 review returns perfect with zero issues"
  },
  "notes_for_implementation": {
    "manualKeys_state_field": "Must be added to state initialization as empty object/map. Will be set/checked in Key and Tick handlers.",
    "KeyRelease_handling": "Bubbletea supports KeyRelease events. Add handler for msg.type === 'KeyRelease' to remove keys from manualKeys.",
    "WASD_in_Tick_handler": "Current WASD in Key handler at msg.type === 'Key'. Move movement logic to Tick handler. Key handler only updates manualKeys.",
    "custom_key_hold": "Implement in Tick handler: check state.manualKeys for pressed keys, apply movement at consistent rate (e.g., every 60ms or based on delta). Do NOT rely on OS repeat.",
    "mouse_events": "Existing mouse handling at line ~1581 works for basic pick/place. Test thoroughly for edge cases.",
    "test_files": "Add tests to existing internal/builtin/bubbletea/pick_place_integration_test.go or create new test file specifically for manual mode and mode switching.",
    "timeout_strategy": "Start with 30s timeouts per test. If legitimately needed, increase but document why. Tests run individually.",
    "hang_prevention": "Isolate tests, clear state between tests, use test-specific timeouts, run hang-possible tests individually.",
    "pabt_preservation": "Ensure NO changes to automatic mode code paths. Verify with tests comparing automatic mode behavior before and after fixes.",
    "verification": "Use subagent for ALL reviews. R1 review, R2 fixes, R3 re-review until perfect."
  }
}
