{
  "meta": {
    "fileName": "blueprint.json",
    "maintenanceInstruction": "KEEP THE PLAN UP TO DATE AS YOU EVOLVE THE CODE. DEVIATIONS TO THE PLAN MUST BE LOGGED WITHIN THE PLAN. THE PLAN MUST BE REASSESSED HOLISTICALLY AFTER ANY CHANGE OF ANY SIZE.",
    "answeringTheQuestionAreYouDone": "**!! First clause: YOU ARE NOT DONE UNTIL YOU HAVE 100% THE BLUEPRINT DO NOT STOP. Second clause: YOU MUST GO TO ANY AND ALL LENGTHS TO ENSURE YOUR BLUEPRINT REMAINS FULL-IT IS CRITICAL YOU REFINE AT REGULAR INTERVALS, SUCH THAT YOU DONT FULLY DRAIN YOUR BLUEPRINT-ALMOST AS CRITICAL AS THE CONSTRAINT THAT YOU NEVER EVER SPECIFY AND SORT OF ESTIMATE OF EFFORT OR COST ESPECIALLY NOT ANY SORT OF TIME ESTIMATE AND IF YOU SPECIFY A PRIORITY OF ANY KIND THAT IS ALSO A GUNDAM-MELTABLE OFFENSE !!**"
  },
  "globalAlerts": [
    {
      "warning": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    }
  ],
  "mandatoryDirectives": {
    "subagentPolicy": "!! MANDATORY OPERATIONAL DIRECTIVE !!",
    "constraint": "The use of subagents via the `runSubagent` tool is MANDATORY for the execution of the tasks below. Tasks are grouped specifically to be run in distinct subagent contexts to prevent context window exhaustion. Do not attempt to solve all groups in a single turn."
  },
  "statusSection": {
    "currentState": "T001-T013 COMPLETE. T013 committed as e9e2099: feat(config): add [hot-snippets] config section with contextManager integration. 13 files changed, 452 insertions(+), 9 deletions(-). Rule of Two passed. Next: T014 (Implement Anthropic prompt library goals Tier 1)."
  },
  "sequentialTasks": [
    {
      "task": "T001-A: Review and commit config schema + write system",
      "description": "Committed as 370ceff: feat(config): add typed schema system with validation, env var resolution, and atomic config writes. 5 files changed, 1861 insertions(+), 38 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T001-B: Review and commit builtin modules (osm:flag + osm:fetch) + registration",
      "description": "Committed as 3e382f1: feat(builtin): add osm:flag and osm:fetch native modules with registration. 6 files changed, 1547 insertions(+).",
      "status": "Done"
    },
    {
      "task": "T001-C: Review and commit scripting engine changes + module require system",
      "description": "Committed as 5ec578e: feat(scripting): add CommonJS require system with file-based scripts, module paths, and shebang handling. 4 files changed, 762 insertions(+), 9 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T001-D: Review and commit new commands (sync + diff splitter)",
      "description": "Committed as 5cc8cb4: feat(command): add sync notebook command and diff splitter for chunked code review. 4 files changed, 1269 insertions(+).",
      "status": "Done"
    },
    {
      "task": "T001-E: Review and commit goal/script discovery + prompt flow + code review + command improvements",
      "description": "Committed as 7455539: feat(command): refine goal/script discovery, prompt flow, code review, and argument validation. 20 files changed, 2288 insertions(+), 131 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T001-F: Review and commit TUI/scripting + context manager + docs + wiring",
      "description": "Committed as 84ec222: feat: context manager improvements, TUI refinements, docs, and wiring. 18 files changed, 3210 insertions(+), 124 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T001: Validate builds pass on all platforms after all granular commits",
      "description": "macOS: ALL PASS (cached). Linux: ALL PASS (clean build, 494s). Windows: requires SSH access. 6 discrete commits: 370ceff, 3e382f1, 5ec578e, 5cc8cb4, 7455539, 84ec222. Total: 57 files changed, ~10,000 insertions.",
      "status": "Done"
    },
    {
      "task": "T002: Wire config schema into production code paths",
      "description": "Committed as d13c49c: Replaced inline isKnownGlobalOption/isKnownCommandOption with post-parse ValidateConfig call in LoadFromReader. Removed init(), knownGlobalOptionsOnce/knownCommandOptionsOnce, isKnownGlobalOption, isKnownCommandOption. Deleted Options(), Validate(), DumpHelp() method aliases from ConfigSchema. Added validate/schema subcommands to ConfigCommand. Used Resolve() for env-var-aware key lookup. Removed all 8 schema.go .deadcodeignore entries. Added 9 new tests. 7 files changed, 293 insertions(+), 147 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T003: Wire diff splitter into code-review command",
      "description": "Committed as aaf6173: Exposed SplitDiff and DefaultMaxDiffLines as JS globals in code_review.go. Added review-chunks command to code_review_script.js (split large diffs, show chunk summary, copy individual chunks with template). Removed diff_splitter.go entries from .deadcodeignore. Added 3 integration tests in code_review_chunk_test.go. 4 files changed, 205 insertions(+), 4 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T004: Audit and reduce .deadcodeignore entries",
      "description": "Committed as 9212fd1: Reduced .deadcodeignore from ~107 to ~47 lines (56% reduction). Deleted: NewEngine wrapper, NewManager wrapper, stale state_contract.go entries. Moved to _test.go: NewTestTUIReader, NewTestTUIWriter, NewTUIWriterStderr, parseMouseEvent, scheduleWrite, 5 scrollbar Option constructors. Fixed test env var dependencies. Added mouseharness/* wildcard. All remaining entries documented with inline comments. 18 files changed, 218 insertions(+), 338 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T005: Fix go-prompt correctness issues from assessment",
      "description": "Committed as 6f18a1f: Fixed 4 correctness issues from scratch/t039-go-prompt-feature-alignment.md. (1) Wired WithHistorySize: added historySize field to promptBuildConfig, applied prompt.WithHistorySize option in buildGoPrompt, populated from historyConfig.Size in jsCreatePrompt. (2) Added DefaultColor: added 'default' case to parseColor, changed fallback from White to DefaultColor. (3) Prompt reference in key handlers: created buildPromptJSObject wrapping 9 prompt methods (insertText, delete, cursor, getText), passed to JS handlers in buildKeyBinds. (4) RunNoExit: switched p.Run() to p.RunNoExit() in both runAdvancedPrompt and jsRunPrompt. Added tui_colors_test.go and tui_keybind_test.go. 6 files changed, 224 insertions(+), 7 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T006: Expose remaining go-prompt features",
      "description": "Committed as 6b1b0b9: Exposed 9 configurable prompt options (maxSuggestion, dynamicCompletion, executeHidesCompletions, escapeToggle, initialText, showCompletionAtStart, completionOnDown, keyBindMode) through createPrompt JS config. Added ~24 missing key constants to parseKeyString (ControlSpace, Control/Alt/Shift+arrows, BackTab, PageUp/Down, Insert, F13-F24, Any, BracketedPaste). Enriched Document API with 11 new methods (getTextAfterCursor, getWordAfterCursor, getCurrentLine, getCurrentLineBeforeCursor/AfterCursor, getCursorPositionCol/Row, getLines, getLineCount, onLastLine, getCharRelativeToCursor). Added 3 prompt methods (terminalColumns, terminalRows, userInputColumns). Added 2 background color properties (inputBackground, prefixBackground). Updated docs/reference/tui-api.md. 8 files changed, 613 insertions(+), 25 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T007: Review and document tview/tcell deprecation",
      "description": "Committed as 31a4c84: Added Deprecated: comments to tview package and Require function. Added runtime deprecation warning to stderr when osm:tview is loaded. Created docs/archive/notes/tview-deprecation.md with comprehensive deprecation plan. Updated docs/scripting.md and docs/reference/tui-lifecycle.md with deprecation notices. Added SA1019 lint ignores for intentional deprecated usage. Added TestRegister_TViewDeprecationWarning test. 7 files changed, 214 insertions(+), 4 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T008: Implement system-style file logging for script commands",
      "description": "Committed as 293924c: Created RotatingFileWriter (size-based rotation with backup pruning, mutex-protected). Added 5 log.* config keys to schema (log.file, log.level, log.max-size-mb, log.max-files, log.buffer-size). Created resolveLogConfig helper consolidating log setup across 5 commands (code-review, goal, prompt-flow, scripting, super-document). Added nil-config safety. 9 rotation tests, 6 config tests (including nil config regression). 10 files changed, 813 insertions(+), 128 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T009: Implement log tailing capability",
      "description": "Committed as b2c93d5: Added LogCommand with tail and follow modes, ring buffer for last-N lines, polling-based follow with rotation detection (file shrink/replacement), cross-platform (no inode/syscall), waitForFile with timeout, resolveLogPath with nil-config safety. 14 test cases with syncBuffer for race-free concurrent testing. Wired into main.go registry. 3 files changed, 812 insertions(+).",
      "status": "Done"
    },
    {
      "task": "T010: Fix duplicate log lines for purged sessions",
      "description": "Committed as 7f19318: Removed two fmt.Printf debug statements from cleanup.go that wrote directly to OS stdout, bypassing the writer architecture. session.go already reports purge actions via CleanupReport to the writer — the fmt.Printf calls caused duplicate output in production. Added TestSessionsPurge_NoDuplicateLogLines (3 sessions, separate stdout/stderr buffers, asserts each ID appears exactly once). 2 files changed, 40 insertions(+), 4 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T011: Implement automatic session cleanup scheduler",
      "description": "Wire up the existing SessionConfig fields (AutoCleanupEnabled, CleanupIntervalHours, MaxAgeDays, MaxCount, MaxSizeMB) which are parsed/validated but not used. Implement cleanup as a background goroutine started during interactive sessions (when autoCleanupEnabled=true). Use internal/storage/cleanup.go for the actual cleanup logic. The goroutine should: run cleanup on startup, then at the configured interval, and stop when the session ends. Add config keys to schema.go. Tests must use mock time and deterministic scheduling - no timing-dependent tests.",
      "status": "Done"
    },
    {
      "task": "T012: Implement VS Code prompt files support",
      "description": "Committed as d825887: Added VS Code .prompt.md file support. Implemented parser for .prompt.md format (YAML frontmatter + Markdown body), LoadPromptFile loader, PromptFileToGoal converter, FindPromptFiles discovery, expandPromptFileReferences for inline file expansion, and DiscoverPromptFilePaths for standard (.github/prompts) and configured search paths. Added prompt.file-paths config key to schema. Wired into DynamicGoalRegistry.Reload(). 30 tests covering parsing (frontmatter variants, edge cases, CRLF), loading, conversion, discovery, and file reference expansion.",
      "status": "Done"
    },
    {
      "task": "T013: Integrate hot-snippet configuration from config file",
      "description": "Committed as e9e2099: Added [hot-snippets] config section. Parse hot-snippets in internal/config/, inject as CONFIG_HOT_SNIPPETS global via injectConfigHotSnippets() into all 5 commands. goal.js merges config+goal snippets (goal wins on name conflict). Other scripts pass config snippets directly. 13 config parsing tests + 6 JS conversion tests. 13 files changed, 452 insertions(+), 9 deletions(-).",
      "status": "Done"
    },
    {
      "task": "T014: Implement Anthropic prompt library goals (Tier 1)",
      "description": "Per docs/archive/notes/anthropic-prompt-library-evaluation.md, implement 4 Tier 1 built-in goals: bug-buster, code-optimizer, code-explainer, meeting-notes. Follow the existing goal_builtin.go pattern. Each goal needs: a system prompt adapted from Anthropic's library, custom commands if appropriate, contextManager integration, and tests. Add the goals to the goal registry in goal_builtin.go. Add unit tests verifying each goal loads, its commands work, and prompt generation produces expected output.",
      "status": "Not Started"
    },
    {
      "task": "T015: Git sync: implement push/pull operations",
      "description": "Per docs/archive/notes/git-sync-design.md, implement git push/pull operations for the sync command. Currently only local save/list are implemented (internal/command/sync.go). Add: (1) `osm sync init <repo-url>` to clone/init a sync repo, (2) `osm sync push` to commit and push local changes, (3) `osm sync pull` to fetch and merge remote changes, (4) Conflict detection and user messaging. Use osm:exec (git CLI) for git operations. Wire sync.repository, sync.enabled, sync.auto-pull config keys. Add tests with temporary git repos.",
      "status": "Not Started"
    },
    {
      "task": "T016: MacosUseSDK integration: implement osm:grpc native module",
      "description": "Per docs/archive/notes/macos-use-sdk-evaluation.md, implement an osm:grpc native module using github.com/joeycumines/goja-grpc for in-process gRPC channels. The module should allow JS scripts to: create gRPC channels, make unary RPC calls, handle streaming responses. This enables connecting to a running MacosUseSDK gRPC server from JS scripts. Add the module to internal/builtin/. Register in register.go. Add unit tests with a mock gRPC server.",
      "status": "Not Started"
    },
    {
      "task": "T017: Coverage audit: internal/argv",
      "description": "Run `go test -coverprofile=coverage.out ./internal/argv/...` and analyze coverage. The package has argv.go, argv_test.go, and argv_fuzz_test.go. Identify uncovered code paths including edge cases in argument parsing (empty args, special characters, quoting, escaping, unicode). Add tests to achieve 100% effective coverage. Verify with `go tool cover -func=coverage.out`.",
      "status": "Not Started"
    },
    {
      "task": "T018: Coverage audit: internal/config",
      "description": "Run coverage analysis for internal/config/. The package now includes config.go, schema.go, and write.go. Identify uncovered paths in: config parsing, location resolution, environment variable handling, default value logic, schema validation, typed getters, SetKeyInFile edge cases. Add tests to achieve 100% effective coverage across all files.",
      "status": "Not Started"
    },
    {
      "task": "T019: Coverage audit: internal/session",
      "description": "Run coverage analysis for internal/session/. Cover all platform-specific session ID generation paths (session_linux.go, session_other.go, session_windows.go). Test edge cases in session locking, ID auto-determination, and fallback logic. Platform-specific code tested via build tags. Achieve 100% coverage on the current platform.",
      "status": "Not Started"
    },
    {
      "task": "T020: Coverage audit: internal/storage",
      "description": "Run coverage analysis for internal/storage/. Cover atomic write paths (including Windows variant), file locking edge cases, cleanup logic, fs_backend operations, memory_backend operations, schema handling, and path utilities. Include platform-specific tests. Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T021: Coverage audit: internal/builtin/exec",
      "description": "Run coverage analysis for internal/builtin/exec/. Test command execution, stdout/stderr capture, exit codes, error handling, timeout behavior, and platform-specific command execution differences (cmd.exe vs sh). Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T022: Coverage audit: internal/builtin/os",
      "description": "Run coverage analysis for internal/builtin/os/. Test readFile, fileExists, openEditor, clipboardCopy (with OSM_CLIPBOARD env override), getenv, and all error paths. Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T023: Coverage audit: internal/builtin/ctxutil",
      "description": "Run coverage analysis for internal/builtin/ctxutil/. Test the contextManager factory, all REPL commands (add, diff, exec, note, list, edit, remove, show, copy, snippets, hot-snippets), coercion utilities, refresh behavior, lazy-exec/lazy-diff patterns, flag-based completion, and the Go-side ctxutil module. Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T024: Coverage audit: internal/builtin/bt",
      "description": "Run coverage analysis for internal/builtin/bt/. Review extensive existing tests (blackboard, bridge, adapter, integration, stress, fuzz). Identify remaining uncovered paths and add tests. Target 100% or near-100% coverage.",
      "status": "Not Started"
    },
    {
      "task": "T025: Coverage audit: internal/builtin/pabt",
      "description": "Run coverage analysis for internal/builtin/pabt/. Review extensive existing tests (actions, evaluation, integration, expr, graph). Identify remaining uncovered paths and add tests. Target 100% or near-100% coverage.",
      "status": "Not Started"
    },
    {
      "task": "T026: Coverage audit: internal/builtin/bubbletea",
      "description": "Run coverage analysis for internal/builtin/bubbletea/. Review existing tests (component integration, core logic, input validation, message conversion, render throttle, runner, key/mouse parsing). Identify uncovered paths and add tests. Target 100% or near-100% coverage.",
      "status": "Not Started"
    },
    {
      "task": "T027: Coverage audit: internal/builtin/fetch",
      "description": "Run coverage analysis for internal/builtin/fetch/. The module already has 26 tests. Identify any uncovered paths in fetch() and fetchStream() including option parsing edge cases, header normalization, and body handling. Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T028: Coverage audit: internal/builtin/flag",
      "description": "Run coverage analysis for internal/builtin/flag/. The module has ~20 tests. Identify any uncovered paths in flag definition, parsing, getters, visit/visitAll, and error handling. Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T029: Coverage audit: internal/builtin remaining packages",
      "description": "Run coverage analysis for all remaining builtin packages: template, time, lipgloss, bubbles/viewport, bubbles/textarea, bubblezone, termui/scrollbar, nextintegerid, unicodetext, argv. These are typically small modules. Add tests to reach 100% coverage for each. Report individual coverage percentages.",
      "status": "Not Started"
    },
    {
      "task": "T030: Coverage audit: internal/scripting engine and runtime",
      "description": "Run coverage analysis for internal/scripting/ core files: engine_core.go, runtime.go, execution_context.go. Cover engine creation (all constructor variants including NewEngineDetailed with options), script loading (file-based and inline), global registration, module loading (native and file-based require), shebang handling, and all error paths. Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T031: Coverage audit: internal/scripting TUI subsystem",
      "description": "Run coverage analysis for internal/scripting/ TUI files: tui_manager.go, tui_commands.go, tui_completion.go, tui_history.go, tui_io.go, tui_js_bridge.go, tui_parsing.go, tui_colors.go, tui_types.go. Cover all mode registration, command dispatch, completion (file, gitref, flag), history management, I/O wrapper, JS bridge, color parsing, and type handling paths. Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T032: Coverage audit: internal/scripting state management",
      "description": "Run coverage analysis for internal/scripting/ state files: state_manager.go, js_state_accessor.go, js_context_api.go, js_logging_api.go, js_output_api.go, context.go. Cover all state operations, session persistence, context management (addPath, refreshPath, removePath), and all JS API bindings (ctx, output, log objects). Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T033: Coverage audit: internal/scripting session and terminal",
      "description": "Run coverage analysis for internal/scripting/ remaining files: session_id_common.go, terminal.go, logging.go, debug_assertions.go/debug_assertions_stub.go. Cover session ID common logic, terminal creation, logging buffer and file infrastructure, and debug assertion paths (both stub and enabled variants). Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T034: Coverage audit: internal/command",
      "description": "Run coverage analysis for internal/command/ package. The package has extensive tests already. Audit for gaps in: registry dispatch, base command helpers, all builtin commands (script, session, goal, prompt-flow, code-review, super-document, completion, config, help, version, init, sync), module_paths helpers, and all error paths. Achieve 100% effective coverage. Integration tests should cover end-to-end flows.",
      "status": "Not Started"
    },
    {
      "task": "T035: Coverage audit: internal/goroutineid, testutil, mouseharness",
      "description": "Run coverage analysis for these three small packages. internal/goroutineid: cover goroutine ID extraction. internal/testutil: cover polling utilities, platform detection, test ID generation. internal/mouseharness: cover mouse event harness and terminal handling. Achieve 100% effective coverage for each.",
      "status": "Not Started"
    },
    {
      "task": "T036: Coverage audit: internal/example/pickandplace",
      "description": "Run coverage analysis for internal/example/pickandplace/. Cover integration, manual mode, bubbletea rendering, and simulation consistency tests. Achieve 100% coverage for example simulation paths.",
      "status": "Not Started"
    },
    {
      "task": "T037: Coverage audit: cmd/osm",
      "description": "Run coverage analysis for cmd/osm/. Cover the main entry point, command dispatch, global flag parsing, and error handling paths. Ensure main_test.go covers all dispatch scenarios including invalid commands, help flags, and version output. Achieve 100% effective coverage.",
      "status": "Not Started"
    },
    {
      "task": "T038: Coverage audit: root-level benchmark and security tests",
      "description": "Audit internal/benchmark_test.go and internal/security_test.go. Ensure benchmark thresholds are appropriate for all platforms (not too tight for slow CI runners). Ensure security tests cover all identified attack vectors: path traversal, input sanitization, resource limits, command injection. No timing-dependent failures allowed.",
      "status": "Not Started"
    },
    {
      "task": "T039: Cross-platform verification: Linux via Docker",
      "description": "Run the full test suite on Linux using `make make-all-in-container`. Fix any Linux-specific test failures. Verify all platform-specific code paths (session_linux.go, registry_unix.go, atomic_write.go, filelock_unix.go) work correctly in a Docker container. Ensure race detection passes. All tests must pass with zero failures.",
      "status": "Not Started"
    },
    {
      "task": "T040: Cross-platform verification: Windows",
      "description": "Run the full test suite on Windows using `make make-all-run-windows` (via hack/run-on-windows.sh). Fix any Windows-specific test failures. Verify platform-specific code paths (session_windows.go, registry_windows.go, atomic_write_windows.go, filelock_windows.go). Address file locking, path separator, and line ending differences. All tests must pass with zero failures.",
      "status": "Not Started"
    },
    {
      "task": "T041: Cross-platform verification: macOS CI parity",
      "description": "Verify the macOS test suite matches CI expectations by running `make all`. Ensure session_other.go (macOS fallback) paths are exercised. Verify clipboard operations with OSM_CLIPBOARD override. Confirm PTY-based tests work correctly. Verify symlink resolution (macOS /private/var/folders vs /var/folders). All tests must pass with zero failures.",
      "status": "Not Started"
    },
    {
      "task": "T042: Documentation audit: scripting.md",
      "description": "Audit and complete docs/scripting.md. Currently many osm: modules have 'TODO' summaries. For each module: add a brief description, list all exported functions with parameters and return types, add at least one usage example. Ensure the module list in scripting.md matches the actual modules registered in internal/builtin/register.go. Cover newly added modules (osm:flag, osm:fetch). Document the module resolution strategy (require for relative, JSON, bare names).",
      "status": "Not Started"
    },
    {
      "task": "T043: Documentation audit: reference docs",
      "description": "Audit all reference documentation: docs/reference/command.md, docs/reference/config.md, docs/reference/goal.md, docs/reference/tui-api.md, docs/reference/tui-lifecycle.md. Ensure they reflect current API surfaces including all new commands (sync), new config keys (sync.*, script.module-paths, etc.), renamed APIs (createPrompt vs createAdvancedPrompt), and new features (hot-snippets, footer, one-step mode). Update stale information. Add missing commands and options.",
      "status": "Not Started"
    },
    {
      "task": "T044: Documentation audit: session.md and configuration.md",
      "description": "Audit docs/session.md and docs/configuration.md for completeness. Ensure session lifecycle, storage backends, cleanup configuration (auto-cleanup fields), and all config keys (including newly added schema keys) are accurately documented. Add new config keys from schema.go. Document env var overrides. Ensure all examples work as described.",
      "status": "Not Started"
    },
    {
      "task": "T045: Documentation audit: architecture.md",
      "description": "Audit docs/architecture.md for completeness. Ensure it reflects the current module structure (including new modules: fetch, flag, sync), command pattern (including sync command), scripting engine architecture (including module require system, EngineOption pattern), data flow, and session management. Update diagrams or descriptions that are stale. Document the module resolution hierarchy.",
      "status": "Not Started"
    },
    {
      "task": "T046: API surface optimization: scripting engine",
      "description": "Review the public API of internal/scripting/. Identify exported types, functions, or methods that should be unexported. Check for consistency in naming (e.g., NewEngine vs NewEngineDetailed vs NewEngineWithConfig - pick one primary constructor). Ensure parameter ordering and return types are consistent. Reduce the API surface to the minimum needed by internal/command/. Update all callers.",
      "status": "Not Started"
    },
    {
      "task": "T047: API surface optimization: command package",
      "description": "Review the public API of internal/command/. Check command registration, flag setup, and execution interfaces for consistency. Ensure the registry, base command, and all command implementations follow a uniform pattern. Identify and remove unnecessary exports. Standardize the Execute(args, stdout, stderr) signature.",
      "status": "Not Started"
    },
    {
      "task": "T048: API surface optimization: storage package",
      "description": "Review the public API of internal/storage/. Ensure the backend interface, cleanup functions, file locking, and atomic write operations have a clean, minimal API. Check for unused or redundant exports (SetTestHookCrashBeforeRename, ClearAllInMemorySessions, SetTestPaths, ResetPaths - consider consolidating test helpers). Remove redundant exports.",
      "status": "Not Started"
    },
    {
      "task": "T049: API surface optimization: builtin module registration",
      "description": "Review the module registration pattern in internal/builtin/register.go. Ensure all modules follow a consistent registration pattern (Require function signature, module naming convention). Check that shared_symbols.go exports only what is necessary. Standardize the require() integration pattern across all builtin modules. Verify no module has a non-standard registration pattern.",
      "status": "Not Started"
    },
    {
      "task": "T050: Performance profiling: scripting engine startup",
      "description": "Profile the scripting engine startup time using Go's built-in profiling tools (pprof). Identify the most expensive initialization steps: Goja VM creation, module registration, global setup, require system initialization. Optimize where possible (lazy module initialization, caching compiled programs, parallel init where safe). Verify improvements against existing benchmarks in internal/benchmark_test.go. No functionality regressions.",
      "status": "Not Started"
    },
    {
      "task": "T051: Performance profiling: session I/O",
      "description": "Profile session I/O operations (read, write, lock, cleanup). Identify bottlenecks in file locking, JSON serialization, and file system operations. Profile AtomicWriteFile for write amplification. Optimize hot paths. Verify against session-related benchmarks. Ensure improvements work across all platforms.",
      "status": "Not Started"
    },
    {
      "task": "T052: Performance profiling: behavior tree and PABT",
      "description": "Profile behavior tree and PABT execution performance. Review existing benchmarks (bt/benchmark_throughput_test.go, pabt/benchmark_test.go). Identify allocation hotspots in the JS-Go bridge (goja.Value conversions, object creation). Optimize the critical path for BT tick execution and PABT planning. Ensure benchmarks show improved or stable performance.",
      "status": "Not Started"
    },
    {
      "task": "T053: Performance profiling: bubbletea render pipeline",
      "description": "Profile the bubbletea rendering pipeline. Review bubbletea/render_throttle_test.go and benchmark_latency_test.go. Ensure render throttling works effectively under load. Identify unnecessary allocations or copying in the JS model to Go render path. Optimize the message conversion pipeline. Verify latency benchmarks pass.",
      "status": "Not Started"
    },
    {
      "task": "T054: Security review: input sanitization",
      "description": "Extend security tests in internal/security_test.go. Audit all user input paths: CLI arguments, config file values, script content, REPL inputs, file paths, git specs, and fetch URLs. Verify proper sanitization and escaping. Test for: command injection through osm:exec module, path traversal via context addPath, malformed input handling in config parser, and script injection via require().",
      "status": "Not Started"
    },
    {
      "task": "T055: Security review: JS sandbox boundaries",
      "description": "Audit the Goja JS sandbox for security boundaries. Verify that JS code cannot access Go internals beyond the exposed APIs. Check that osm:exec and osm:os modules have appropriate safeguards (no arbitrary file system access beyond what is explicitly allowed). Verify file system access is bounded to intended paths via context management. Document the security posture of each osm: module.",
      "status": "Not Started"
    },
    {
      "task": "T056: Error handling consistency audit",
      "description": "Audit error handling consistency across the entire codebase. Verify: (a) consistent error wrapping with fmt.Errorf and %w verb, (b) proper non-zero exit codes for all command failures, (c) no swallowed errors (every error is either returned, logged, or explicitly documented as intentionally ignored), (d) consistent error message formatting (lowercase, no trailing period, includes context), (e) proper cleanup on error paths (defer for close/unlock). Fix all inconsistencies found.",
      "status": "Not Started"
    },
    {
      "task": "T057: Code deduplication: command execution patterns",
      "description": "Review duplicated code in command Execute() methods. PromptFlowCommand, CodeReviewCommand, GoalCommand, SuperDocumentCommand, and ScriptingCommand share significant boilerplate: engine creation with options, test mode setup, global registration, script loading and execution, logging flag handling. Extract common patterns into a shared executeScript helper in base.go or a new shared file. Each command's Execute() should become concise and unique.",
      "status": "Not Started"
    },
    {
      "task": "T058: Code deduplication: flag setup patterns",
      "description": "Review duplicated flag definitions across commands. Flags like --session, --store, --test, --log-level, --log-file, --log-buffer are repeated in every script-executing command. Extract common flag groups into reusable definitions (e.g., scriptFlags struct with RegisterFlags method) that can be applied to any command's FlagSet. Adding a new common flag should require changing only one place.",
      "status": "Not Started"
    },
    {
      "task": "T059: Code deduplication: JS script boilerplate",
      "description": "Review duplicated patterns in embedded JS scripts (prompt_flow_script.js, code_review_script.js, goal.js, contextManager.js). Identify shared patterns: mode registration, command wiring (buildCommands pattern), state management (get/set patterns), prompt building (buildPrompt/assembleFinal). Consider extracting shared JS utilities into a common module that built-in scripts can require. Ensure all tests pass after refactoring.",
      "status": "Not Started"
    },
    {
      "task": "T060: Dead code elimination pass",
      "description": "Run `make deadcode` and review all results. Cross-reference with .deadcodeignore (which should be minimal after T004). For any newly discovered dead code: wire it into production, move it to test-only files, or delete it. Verify no .deadcodeignore entries accumulate. Run `make lint` to ensure all linters pass after changes.",
      "status": "Not Started"
    },
    {
      "task": "T061: Add missing benchmarks",
      "description": "Review internal/benchmark_test.go for completeness. Add benchmarks for: context manager operations (add/remove/refresh/buildPrompt), config loading and parsing, goal discovery (FindGoalFiles with various directory structures), script discovery, module loading via require(), prompt building (assembleFinal), template execution, and SetKeyInFile. Ensure all performance-critical paths have benchmarks with appropriate thresholds.",
      "status": "Not Started"
    },
    {
      "task": "T062: Verify cross-platform benchmark stability",
      "description": "Verify that all benchmark thresholds in internal/benchmark_test.go are stable across macOS, Linux (Docker), and Windows. Run benchmarks on each platform and record variance. Adjust thresholds that are too tight for slower platforms (CI runners are typically slower than dev machines). Ensure no timing-dependent benchmark failures can occur in CI. Add platform-specific threshold multipliers if needed.",
      "status": "Not Started"
    },
    {
      "task": "T063: Final integration test: macOS",
      "description": "Run the complete test suite on macOS: `make all` (or `make make-all-with-log` for full logging). Verify zero failures. Verify all features from T001-T016 have adequate integration tests. Verify coverage meets targets. This is a final gate before tagging a release.",
      "status": "Not Started"
    },
    {
      "task": "T064: Final integration test: Linux",
      "description": "Run the complete test suite on Linux: `make make-all-in-container`. Verify zero failures. Fix any Linux-specific issues found. This is a final gate confirming all platform-specific paths work on Linux.",
      "status": "Not Started"
    },
    {
      "task": "T065: Final integration test: Windows",
      "description": "Run the complete test suite on Windows: `make make-all-run-windows`. Verify zero failures. Fix any Windows-specific issues found. This is a final gate confirming all platform-specific paths work on Windows.",
      "status": "Not Started"
    },
    {
      "task": "T066: Final documentation and changelog update",
      "description": "Update CHANGELOG.md with all changes made across all tasks. Update README.md if needed (new features, new commands). Annotate completed items in docs/todo.md. Update docs/README.md index if new docs were added. Verify all documentation cross-references are valid (no broken links). Ensure every new command, module, and config key is documented somewhere.",
      "status": "Not Started"
    },
    {
      "task": "T067: Shell completion improvements",
      "description": "Review internal/command/completion_command.go for completeness. Ensure shell completions (bash, zsh, fish) cover all commands and subcommands including newly added ones (sync save, sync list, config key value). Add completion for goal names, script names, session IDs, and config keys. Test generated completion scripts by sourcing them in the respective shells. Add integration tests.",
      "status": "Not Started"
    },
    {
      "task": "T068: Verify all example scripts execute without errors",
      "description": "Run every script in the scripts/ directory through `osm script --test <script>` and verify no errors. Scripts to test: example-01 through example-05, test-01 through test-03, minimal-bubbletea-test.js, benchmark-input-latency.js (in non-interactive mode if possible), test-shooter-error.js. Fix any scripts that fail due to API changes made in T001. Update scripts to use new API names (e.g., createPrompt vs createAdvancedPrompt).",
      "status": "Not Started"
    },
    {
      "task": "T069: Go module dependency audit",
      "description": "Run `go list -m -u all` and `govulncheck ./...` to check for outdated dependencies and known security vulnerabilities. Update dependencies that have security fixes. Run `go mod tidy` to clean up go.sum. Verify `make all` passes after any dependency updates. Document any dependencies intentionally held at older versions with rationale.",
      "status": "Not Started"
    },
    {
      "task": "T070: Continuous scope expansion: identify and plan next-frontier tasks",
      "description": "After completing all preceding tasks and reaching stable-state, perform a holistic review of the codebase and identify the next set of improvements, refinements, and features. Consider: workflow engine for multi-step prompts, plugin system for third-party modules, MCP server integration, prompt template marketplace, collaborative features, performance regression testing infrastructure, fuzz testing expansion. Add new tasks to this blueprint. The task list must never be empty.",
      "status": "Not Started"
    }
  ],
  "continuousVerification": {
    "task": "Run 'make all' with full logging after EVERY significant change",
    "description": "Execute 'make make-all-with-log' after: (a) Each code change, (b) Each test addition, (c) Each task completion, (d) Each bug fix.",
    "failPolicy": "If ANY test fails, STOP IMMEDIATELY and fix the issue before proceeding. Zero tolerance for test failures, timing issues, non-determinism, or race conditions.",
    "testCoverage": "You will ALWAYS aim for 100% effective test coverage, and VERIFY test coverage by means of the tooling available to you. You will NOT proceed to the next task until you have achieved 100% effective test coverage for the current task, and have verified that coverage with the tools available to you."
  },
  "finalEnforcementProtocol": [
    {
      "type": "POST_EXECUTION_WARNING",
      "alert": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    },
    {
      "type": "POST_EXECUTION_WARNING_REPEATED",
      "alert": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    }
  ]
}
