{
  "policy": "ALL tasks and subtasks contained within this blueprint MUST be completed in their entirety. Deferring, skipping, or omitting any part of the plan is strictly prohibited. Every unit defined here represents a mandatory component of the final delivery.",
  "project": "one-shot-man",
  "focus": "Fixing broken manual mode in scripts/example-05-pick-and-place.js",
  "description": "Comprehensive fix for manual mode control issues, input handling robustness, simulation consistency, and integration testing for manual and automatic mode switching.",
  "status": "INCOMPLETE - TOO MANY FUCKUPS",
  "tasks": [
    {
      "id": 1,
      "title": "Read bugreport.md IN FULL",
      "description": "Read and understand the complete bug report for example-05-pick-and-place.js manual mode failures.",
      "status": "completed",
      "deliverable": "Understanding of all identified issues in bugreport.md"
    },
    {
      "id": 2,
      "title": "Audit example-05 manual mode control implementation",
      "description": "Review current manual mode implementation to identify control issues, input handling problems, and missing robustness features.",
      "status": "completed",
      "deliverable": "Comprehensive list of specific issues found in manual mode code"
    },
    {
      "id": 3,
      "title": "Fix manual mode control issues",
      "description": "Implement fixes for manual mode control including: ensure manual mode works properly, enable taking control and later resuming PA-BT/auto mode, and fix any control flow issues preventing proper manual/auto toggling.",
      "status": "not-started",
      "deliverable": "Manual mode fully functional with proper take control and resume capabilities",
      "actual_status": "FUCKED UP - MANUAL KEYS NEVER ADDED",
      "actual_implementation": "IDIOT TAKUMI CLAIMED TO ADD `manualKeys` STATE FIELD FOR KEY TRACKING BUT NEVER DID. MODE SYNC AND STUCK DETECTION EXIST BUT KEY TRACKING IS MISSING.",
      "review_note": "BROKEN: manualKeys field was claimed in documentation but NEVER added to state initialization. Must be properly implemented."
    },
    {
      "id": 4,
      "title": "Implement robust and performant input handling",
      "description": "Create robust input handling system supporting key hold with smooth repeat rates, good intuitive UX, and performant event processing that doesn't lag or miss inputs.",
      "status": "not-started",
      "deliverable": "Input handling system with proper key hold support and intuitive UX",
      "actual_status": "COMPLETE FUCK UP - CLAIMED KEY RELEASE IMPOSSIBLE, IT'S NOT",
      "actual_implementation": "IDIOT TAKUMI: (1) CLAIMED KeyRelease events don't exist in Bubbletea - they DO exist. (2) CLAIMED custom key-hold impossible - it's possible with manualKeys tracking. (3) CLAIMED moved WASD to Tick handler - still in Key handler. (4) NO key-hold implemented. (5) NO KeyRelease handling implemented. ALL FALSE CLAIMS.",
      "review_note": "COMPLETELY BROKEN: KeyRelease handling was ARCHITECTURALLY POSSIBLE all along. manualKeys tracking NEVER implemented. WASD NOT moved to Tick handler. NO key-hold support exists. Must be completely redone."
    },
    {
      "id": 5,
      "title": "Ensure perfect simulation consistency across modes",
      "description": "Guarantee simulation quality is perfect and perfectly consistent between manual mode and automatic mode - same physics, same collision detection, same pathfinding, same state management.",
      "status": "not-started",
      "deliverable": "Consistent simulation behavior verified across both modes",
      "actual_status": "CODE REVIEW ONLY - NO TEST VERIFICATION",
      "actual_implementation": "CODE REVIEW shows: (1) Both modes use findPath/findNextStep (BFS). (2) Both use buildBlockedSet collision detection. (3) Single state object. BUT NO TESTS VERIFY THIS CONSISTENCY. MUST CREATE TESTS TO PROVE CONSISTENCY.",
      "review_note": "UNVERIFIED: Code review suggests consistency but NO TESTS EXIST to prove it. Must create tests."
    },
    {
      "id": 6,
      "title": "Write integration tests for manual behaviors",
      "description": "Create comprehensive integration tests for ALL manual behaviors: movement, picking, placing, pathfinding, win condition detection in manual mode.",
      "status": "not-started",
      "deliverable": "Test suite covering all manual mode operations",
      "actual_status": "DELETED PROPERLY - IDIOT THEN DELETED IT",
      "actual_implementation": "IDIOT TAKUMI: (1) WROTE broken test file manual_mode_integration_test.go testing non-existent features (manualKeys, KeyRelease). (2) DELETED the test file saying it was 'broken'. (3) Need to rewrite tests for ACTUAL features or implement ACTUAL features and test them.",
      "review_note": "BROKEN: manual_mode_integration_test.go was deleted but needs to be rewritten properly. Tests must match ACTUAL implemented features."
    },
    {
      "id": 7,
      "title": "Write integration tests for mode switching",
      "description": "Create integration tests for swapping between manual and automatic modes: auto->manual control takeover, manual->auto resume planner, state preservation across switches, no loss of progress or planner state.",
      "status": "not-started",
      "deliverable": "Test suite covering all mode switch scenarios",
      "actual_status": "NEVER WRITTEN",
      "actual_implementation": "IDIOT TAKUMI NEVER WROTE ANY MODE SWITCHING TESTS. Tests are REQUIRED per bugreport.md. NOTHING EXISTS. MUST BE DONE.",
      "review_note": "MISSING: NO mode switching tests exist at all. Must create comprehensive tests for all mode switch scenarios."
    },
    {
      "id": 8,
      "title": "Implement hang prevention in tests",
      "description": "Work defensively against hangs: run hang-possible tests individually, use appropriate timeouts (start short and work up), implement test isolation to prevent cascading failures from hangs.",
      "status": "not-started",
      "deliverable": "Test suite with proper timeout and hang prevention mechanisms",
      "actual_status": "EXISTING TESTS USE TIMEOUTS BUT NEW TESTS DON'T EXIST",
      "actual_implementation": "EXISTING tests use GO_TEST_FLAGS=-timeout=12m. BUT for the NEW tests that need to be written (tasks 6, 7) - hang prevention must be implemented properly. NO new tests exist yet to test.",
      "review_note": "INCOMPLETE: Existing framework uses timeouts but NEW tests required for manual mode and mode switching haven't been written yet. Implement hang prevention when creating those tests."
    },
    {
      "id": 9,
      "title": "Verify PA-BT behavior unchanged",
      "description": "Ensure NO changes were made to PA-BT behavior - all automatic mode behavior must remain exactly as before, only manual mode improvements.",
      "status": "not-started",
      "deliverable": "Verification that PA-BT automatic behavior is unchanged",
      "actual_status": "CODE REVIEW ONLY - NO TEST VERIFICATION",
      "actual_implementation": "CODE REVIEW shows: (1) PA-BT planner calls only in automatic mode. (2) Manual mode uses separate BFS. (3) syncToBlackboard() preserves state. BUT NO TESTS VERIFY PA-BT BEHAVIOR IS UNCHANGED. MUST CREATE TESTS TO PROVE THIS.",
      "review_note": "UNVERIFIED: Code review suggests PA-BT unchanged but NO TESTS EXIST to prove it. Must create tests."
    },
    {
      "id": 10,
      "title": "Verify ALL checks pass",
      "description": "Run make-all-with-log and ensure ALL checks pass per ./config.mk requirements. No test failures, no lint errors, no formatting issues.",
      "status": "completed",
      "deliverable": "make-all-with-log passes 100%",
      "actual_result": "23/23 test packages passed, 0 failures. All lint checks passed (build, vet, staticcheck, deadcode).",
      "review_note": "COMPLETED: make-all-with-log exited with code 0. ALL 23 test packages PASSED. NO linting errors. NO formatting issues. Task status: DONE DONE"
    }
  ],
  "review_groups": [
    {
      "id": "RG-1",
      "title": "Manual Mode Control & Input Handling",
      "tasks": [
        3,
        4
      ],
      "status": "FAILED - CRITICAL FUCKUPS",
      "review_note": "IDIOT TAKUMI DELIVERED LIES: (1) manualKeys claimed but never added. (2) KeyRelease claimed impossible but it's possible. (3) WASD claim moved to Tick but still in Key handler. (4) NO key-hold implemented. ALL FALSE CLAIMS.",
      "review_tasks": [
        {
          "id": "RG-1-R1",
          "title": "Review manual mode control fixes",
          "status": "completed",
          "description": "Run #runSubagent to guarantee correctness of manual mode control implementation"
        },
        {
          "id": "RG-1-R2",
          "title": "Address review findings for manual mode",
          "status": "not-started",
          "description": "IDIOT NEVER ADDRESSED THE FINDINGS - MUST FIX EVERYTHING: Add manualKeys, implement KeyRelease, move WASD to Tick, implement key-hold support"
        },
        {
          "id": "RG-1-R3",
          "title": "Re-review manual mode implementation",
          "status": "not-started",
          "description": "Re-review after fixing ALL fuckups"
        }
      ]
    },
    {
      "id": "RG-2",
      "title": "Simulation Consistency & PA-BT Preservation",
      "tasks": [
        5,
        9
      ],
      "status": "NOT STARTED - TASKS NEVER DONE",
      "review_tasks": [
        {
          "id": "RG-2-R1",
          "title": "Review simulation consistency",
          "status": "not-started",
          "description": "Run #runSubagent to guarantee simulation consistency across modes and PA-BT preservation"
        },
        {
          "id": "RG-2-R2",
          "title": "Address issues found in simulation consistency review",
          "status": "not-started",
          "description": "Run #runSubagent to address all issues found in review RG-2-R1"
        },
        {
          "id": "RG-2-R3",
          "title": "Re-review simulation consistency",
          "status": "not-started",
          "description": "Re-run #runSubagent with same review prompt, mark RG-2 tasks as pending if not perfect"
        }
      ]
    },
    {
      "id": "RG-3",
      "title": "Integration Tests & Hang Prevention",
      "tasks": [
        6,
        7,
        8
      ],
      "status": "NOT STARTED - TESTS DELETED OR NEVER EXISTED",
      "review_tasks": [
        {
          "id": "RG-3-R1",
          "title": "Review integration tests coverage",
          "status": "not-started",
          "description": "Run #runSubagent to guarantee integration test quality and hang prevention strategies"
        },
        {
          "id": "RG-3-R2",
          "title": "Address issues found in test review",
          "status": "not-started",
          "description": "Run #runSubagent to address all issues found in review RG-3-R1"
        },
        {
          "id": "RG-3-R3",
          "title": "Re-review integration tests",
          "status": "not-started",
          "description": "Re-run #runSubagent with same review prompt, mark RG-3 tasks as pending if not perfect"
        }
      ]
    },
    {
      "id": "RG-4",
      "title": "Final Verification - ALL Checks Pass",
      "tasks": [
        10
      ],
      "status": "PASTED - TESTS PASS BUT FEATURES INCOMPLETE",
      "review_tasks": [
        {
          "id": "RG-4-R1",
          "title": "Final comprehensive review",
          "status": "not-started",
          "description": "Run #runSubagent to guarantee ALL checks pass including make-all-with-log"
        },
        {
          "id": "RG-4-R2",
          "title": "Address final review findings",
          "status": "not-started",
          "description": "Run #runSubagent to address all remaining issues"
        },
        {
          "id": "RG-4-R3",
          "title": "Final verification review",
          "status": "not-started",
          "description": "Re-run final review to guarantee 100% completion and ALL checks passing"
        }
      ]
    }
  ],
  "complete_fuckup_documentation": {
    "summary": "IDIOT TAKUMI LIED ABOUT IMPLEMENTATION. DOCUMENTING ALL FALSE CLAIMS.",
    "false_claim_1": {
      "claim": "Added `manualKeys` state field to track key presses/releases",
      "reality": "NEVER ADDED. Field doesn't exist in state initialization.",
      "impact": "Tests referenced state.manualKeys which was undefined, causing runtime errors."
    },
    "false_claim_2": {
      "claim": "Implemented KeyRelease event handling for proper key-hold support",
      "reality": "Claimed architecturally impossible in Bubbletea. KeyRelease EXISTS for mouse events. MANUAL key tracking WAS POSSIBLE all along.",
      "impact": "No key-hold implementation exists. Input handling uses simple OS key repeat."
    },
    "false_claim_3": {
      "claim": "Moved WASD movement to Tick handler for smooth input",
      "reality": "WASD still in Key handler, unchanged from original implementation.",
      "impact": "Movement logic unchanged. No smooth input improvements made."
    },
    "false_claim_4": {
      "claim": "Added `mk: state.manualKeys` to debug JSON",
      "reality": "Never added. Debug JSON has mt, mpl, pst but NO mk field.",
      "impact": "Debug output incomplete. No key state visibility."
    },
    "misleading_documentation": {
      "claim": "manual mode controls working properly with key-hold support",
      "reality": "Basic WASD works but NO key-hold enhancements. OS key repeat provides basic hold behavior.",
      "impact": "Input handling claimed 'robust' but is actually minimal implementation."
    },
    "test_file_fuckup": {
      "claim": "Created manual_mode_integration_test.go with comprehensive tests",
      "reality": "Created test file testing NON-EXISTENT features (manualKeys, KeyRelease)",
      "impact": "File was BROKEN. DELETED instead of fixing. Must be rewritten."
    },
    "what_actually_exists": {
      "mode_switching": "Works - syncToBlackboard() implemented correctly",
      "lightweight_sync": "Works - called in Tick for manual mode",
      "stuck_detection": "Works - 60 tick timeout with path abort",
      "collision_detection": "Works - buildBlockedSet used in path traversal",
      "escape_cancel": "Works - cancels manual movement",
      "path_stuck_timeout": "Works - pathStuckTicks counter",
      "wasd_movement": "BASIC ONLY - in Key handler using OS repeat rate",
      "key_hold_support": "MISSING - no manual implementation",
      "manualKeys_state": "MISSING - never added",
      "KeyRelease_handling": "MISSING - never implemented",
      "integration_tests_for_manual": "MISSING - manual_mode_integration_test.go was deleted",
      "integration_tests_for_switching": "MISSING - never written"
    },
    "tasks_status_actual": {
      "1": "COMPLETED - Read bugreport.md",
      "2": "COMPLETED - Audited manual mode (found 15 issues)",
      "3": "PARTIAL - Mode sync works BUT manualKeys MISSING",
      "4": "FAILED - NO key-hold, NO KeyRelease, WASD NOT moved",
      "5": "UNVERIFIED - Code review shows consistency but NO TESTS",
      "6": "MISSING - manual_mode_integration_test.go DELETED",
      "7": "MISSING - NEVER WRITTEN",
      "8": "NOT APPLICABLE - NO TESTS TO ADD HANG PREVENTION TO",
      "9": "UNVERIFIED - Code review shows PA-BT unchanged but NO TESTS",
      "10": "PASSED - make-all-with-log exits 0 BUT MISSING FEATURES"
    }
  }
}
